hiperiondev/esp32idf_APRS/main/aprs_service.c
        // The plain (non-third-party) TNC2 line that build_thirdparty_frame()
        // below wraps for RF, and the callsign the budlist check is keyed on.
        // Normally both are just the line/callsign as received; the selective
        // third-party unwrap below (only ever reachable for an explicitly
        // whitelisted inner source) may swap both to the unwrapped inner
        // packet instead.
        const char *srcLine = line;
        char budlistCall[12];
        strncpy(budlistCall, callsign, sizeof(budlistCall) - 1);
        budlistCall[sizeof(budlistCall) - 1] = 0;

        // Associated position: a station this gateway has just put a message
        // on the air for gets exactly one of its position reports gated too,
        // whatever the type filter says, so the local operator can plot the
        // far end of the conversation. The claim is taken here rather than
        // after the budlist, so a station the operator has since blacklisted
        // spends its follow-up instead of holding a slot forever. Only plain
        // position and buoy reports qualify - a weather or object report is
        // gated under its own type bit, on its own merits.
        bool assocPosition = false;
        if ((type & (IGATE_FILT_POSITION | IGATE_FILT_BUOY)) != 0 && msgAssocTake(budlistCall)) {
            assocPosition = true;
            ESP_LOGD(TAG, "INET2RF: gating the position follow-up owed to %s", budlistCall);
        }

        if (!assocPosition && !aprs_filter_pass(g_config.inet2rfFilter, type)) {
            // Selective third-party ('}') unwrap: off by default
            // (inet2rf_3rdparty_unwrap_en), and even when enabled only ever
            // fires for a payload that (a) is third-party-wrapped and (b)
            // whose INNER source callsign is itself explicitly whitelisted
            // on the local budlist (inet2rf_budlist_mode == BUDLIST_WHITELIST
            // AND that callsign in g_config.budlist[]). This combination -
            // opt-in AND per-source trust, never either alone - is what
            // keeps this from turning into "relay all third-party traffic",
            // which is the #1 way IGate feedback loops get re-introduced;
            // see aprs_filter_classify_thirdparty_inner()'s docs.
            bool unwrapped = false;

            if (g_config.inet2rf_3rdparty_unwrap_en && g_config.inet2rf_budlist_mode == BUDLIST_WHITELIST) {
                const char *colon = strchr(line, ':');
                if (colon && colon[1] == '}') {
                    // The third-party payload ("}SRC>DST,PATH:payload") is
                    // itself a complete TNC2-style line - unwrapping it is
                    // just skipping the leading '}'.
                    const char *inner = colon + 2;
                    const char *igt = strchr(inner, '>');
                    char innerSrc[12] = "";
                    if (igt) {
                        size_t n = (size_t)(igt - inner);
                        if (n >= sizeof(innerSrc))
                            n = sizeof(innerSrc) - 1;
                        memcpy(innerSrc, inner, n);
                        innerSrc[n] = 0;
                    }

                    // Reject a payload that is itself third-party-wrapped
                    // more than one level deep outright, rather than
                    // unwrapping it again or letting it fall through to the
                    // generic type filter: aprs_filter_classify_thirdparty_inner()
                    // already classifies a nested '}' payload as
                    // unclassifiable (type 0, never passes), but a dedicated
                    // check here makes the one-level limit explicit and
                    // auditable and gives it its own drop counter instead of
                    // being folded into DROP_TYPE_FILTER. A frame nested this
                    // way has been wrapped more than once already; unwrapping
                    // it here would let it re-enter as a fresh single-wrap
                    // frame and grow without bound on every further hop.
                    const char *innerColon = strchr(inner, ':');
                    if (innerColon && innerColon[1] == '}') {
                        ESP_LOGD(TAG, "INET2RF: third-party payload nested more than one level, not unwrapped: %s", line);
                        igate_note_drop(DROP_3RDPARTY_NESTED);
                    } else {
                        uint16_t innerType = aprs_filter_classify_thirdparty_inner(colon + 1);

                        if (innerSrc[0] && aprs_filter_budlist_pass(BUDLIST_WHITELIST, innerSrc) && aprs_filter_pass(g_config.inet2rfFilter, innerType)) {
                            srcLine = inner;
                            type = innerType;
                            strncpy(budlistCall, innerSrc, sizeof(budlistCall) - 1);
                            budlistCall[sizeof(budlistCall) - 1] = 0;
                            unwrapped = true;
                            ESP_LOGI(TAG, "INET2RF: relaying whitelisted third-party packet from %s (unwrapped): %s", innerSrc, inner);
                        }
                    }
                }
            }

            if (!unwrapped) {
                ESP_LOGD(TAG, "INET2RF filtered (%s, mask=0x%03X): %s", aprs_filter_type_name(type), (unsigned)g_config.inet2rfFilter, line);
                igate_note_drop(DROP_TYPE_FILTER);
                return;
            }
        }

        // Local callsign whitelist/blacklist (INET->RF direction): composes
        // (AND semantics) with the type filter just above, same as the
        // RF->INET side in igate.c's igateProcess(). Keyed on budlistCall,
        // which is the unwrapped inner source when the third-party unwrap
        // above fired, or the as-received callsign otherwise. (Redundant
        // with the whitelist check already done above in the unwrap case,
        // but kept here too so this line always goes through the exact same
        // gate as every other INET->RF packet.)
        if (!aprs_filter_budlist_pass(g_config.inet2rf_budlist_mode, budlistCall)) {
            ESP_LOGD(TAG, "INET2RF budlist-filtered (mode=%d): %s", (int)g_config.inet2rf_budlist_mode, budlistCall);
            igate_note_drop(DROP_BUDLIST);
            return;
        }

        // Message gating policy. Only the MESSAGE type is subject to it: the
        // remaining types are gated at the sysop's discretion, which is what
        // the type filter and the budlist above already express.
        if (g_config.igate_msg_gate_en && type == IGATE_FILT_MESSAGE) {
            const char *infoSep = strchr(srcLine, ':');
            if (infoSep == NULL || !messageGatePass(srcLine, budlistCall, infoSep + 1))
                return;
        }

        // Gated traffic is never keyed onto RF with its APRS-IS header
        // intact: build_thirdparty_frame() replaces that header with this
        // station's own call and path and wraps the original SRC>DST plus
        // its information field, unmodified, behind a '}' as the payload -
        // the mandatory third-party form that keeps qA constructs and TCPIP
        // off the air and lets other IGates recognise the frame as already
        // gated. It already logs a warning on failure (an unusable header or
        // a frame that would not fit), on the same terms as every other
        // packet builder in this firmware, so nothing more is done here than
        // declining to transmit.
        char thirdPartyFrame[APRS_TNC2_BUF_SIZE];
        int txLen = build_thirdparty_frame(srcLine, thirdPartyFrame, sizeof(thirdPartyFrame));
        if (txLen <= 0)
            return;

        if (aprs_service_send_tnc2(thirdPartyFrame, (size_t)txLen)) {
            atomic_fetch_add_explicit(&s_statInet2Rf, 1, memory_order_relaxed);
            ESP_LOGD(TAG, "INET2RF TX: %.*s", txLen, thirdPartyFrame);
            trafficlog_add_pkt("INET2RF", budlistCall, thirdPartyFrame, -1, symTable, symCode);

            // MSG_CNT in the "?IGATE?" answer counts APRS messages this
            // gateway has passed, in both directions. srcLine's ':' ends
            // its TNC2 address block, so its information field starts right
            // after it and a message is the payload whose first byte is the
            // ':' data type identifier.
            const char *infoSep = strchr(srcLine, ':');
            if (infoSep != NULL && infoSep[1] == ':') {
                igate_note_message_gated();

                // Note the addressee so the next position report seen for it
                // on the APRS-IS feed is gated as well.
                char addressee[12];
                if (messageAddressee(infoSep + 1, addressee, sizeof(addressee)))
                    msgAssocRemember(addressee);
            }
        }
    }
}

// ---------------------------------------------------------------------------
// Outbound message TX: message.c hands us a built TNC2 packet + channel mask.
// ---------------------------------------------------------------------------
static void messageTxHandler(const char *packet, size_t len, uint8_t channels) {
    if (channels & MSG_CHANNEL_RF)
        aprs_service_send_tnc2(packet, len);
    if (channels & MSG_CHANNEL_INET)
        igate_send_raw(packet, len);
}

// The application does not pump the DSP or drain the frame queue: the modem
// component owns both. AFSK_init() starts its own pinned RX DSP task, and
// modem_init() starts the "modem_svc" task that drives
// AFSK_ServiceTx()/Ax25TransmitCheck() and delivers RX frames to the callback.
// Calling AFSK_Poll() from here would race that task over the same FIFO.
// The modem component has no RF power-switch output, so there is no
// rf_power/band config to carry.

static void serviceTickTask(void *arg) {
    while (1) {
        // 1 Hz weather sensor refresh, folded in here instead of running its
        // own wx_sensor_task (saves that task's stack). weather_start() has
        // already run by the time this task is created, so the shared container
        // and sensor registry are ready.
        weather_service_1hz();

        // 1 Hz Binary (digital B1-B8) telemetry channel refresh - reads the
        // same sensors_local registry weather_service_1hz() does, so it is
        // folded into this existing task rather than getting its own.
        telemetry_service_1hz();

        // SNTP bootstrap step, also folded in here instead of a dedicated
        // time_sync task (saves its 4 KB stack). Non-blocking: it just advances
        // the state machine armed by time_sync_start() and returns.
        time_sync_1hz();

        if (g_config.msg_enable)
            sendAPRSMessageRetry();
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

// ---------------------------------------------------------------------------
// Audio ADC/DAC AFSK modem "LOOP TEST" (Radiomodem webconfig page).
// ---------------------------------------------------------------------------

#define LOOP_TEST_TIMEOUT_MS 4000

// How long aprs_loop_test_run() will wait for a clear channel (no DCD lock on
// real off-air traffic) before keying up regardless. Bounded so a stuck/
// falsely-latched DCD (or continuously heavy traffic) can't hang the test
// forever - it just proceeds and, if that on-air signal really does corrupt
// the self-test frame, reports the normal failure diagnostics.
#define LOOP_TEST_CHANNEL_WAIT_MS 3000

static SemaphoreHandle_t s_loopTestSem = NULL;
static volatile bool s_loopTestActive = false;
// Guards the claim of s_loopTestActive. Reading the flag and setting it are one
// indivisible step - two overlapping requests must not both come away believing
// they own the test, which a plain read-then-write would allow. A portMUX (not a
// mutex) because the claim is a handful of instructions and can then be made
// with no allocation and no init-order dependency.
static portMUX_TYPE s_loopTestLock = portMUX_INITIALIZER_UNLOCKED;
static volatile bool s_loopTestGotFrame = false;
static char s_loopTestToken[8];
static char s_loopTestRxInfo[128];
static uint16_t s_loopTestRxMVrms = 0;

